//=============================================================================
//
// メイン処理 [main.h]
// Author : 青木睦浩
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#define _CRT_SECURE_NO_WARNINGS
#include <windows.h>
#include "d3dx9.h"                    //描画に必要
#define DIRECTINPUT_VERSION (0x0800)  //ビルド時の警告対処用マクロ
#include "dinput.h"                   //入力処理に必要
#include "xaudio2.h"                  //XAudio関連のヘッダー
#pragma comment(lib, "winmm.lib")
#include <stdio.h>
#include <Xinput.h>

//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment(lib, "d3d9.lib")     //描画に必要
#pragma comment(lib, "d3dx9.lib")    //[d3d9.lib]の拡張ライブラリ
#pragma comment(lib, "dxguid.lib")   //DirectXコンポーネント（部品）使用に必要
#pragma comment(lib, "dinput8.lib")  //入力処理に必要
#pragma comment(lib, "xinput.lib")  //入力処理に必要

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH (1280)  //ウィンドウの幅
#define SCREEN_HEIGHT (720)  //ウィンドウの高さ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
int GetFPS(void);

#endif