//=============================================================================
//
// ポリゴンクラス [3dpolygon.h]
// Author : 小笠原　彪我
//
//=============================================================================
#ifndef _3DPOLYGON_H_
#define _3DPOLYGON_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"

//=============================================================================
// マクロ定義
//=============================================================================

//*****************************************************************************
//	プレイヤークラス
//*****************************************************************************
class C3DPolygon : public CScene3D
{
public:
	C3DPolygon();			// コンストラクタ
	~C3DPolygon();			// デストラクタ

	HRESULT Init(void);		// 初期化処理
	void Uninit(void);		// 終了処理
	void Update(void);		// 更新処理
	void Draw(void);		// 描画処理

	static C3DPolygon *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 scale);		// 生成処理

private:
	static LPDIRECT3DTEXTURE9	m_pTexture;		// 共有テクスチャのポインタ
	D3DXVECTOR3					m_pos;			// 位置
	D3DXVECTOR3					m_rot;			// 向き
	D3DXVECTOR3					m_scale;		// 大きさ
	D3DXVECTOR3					m_move;			// 移動量
	D3DXCOLOR					m_color;		// 色
	bool						m_bUninit;		// 破棄
};
#endif //!_3DPOLYGON_H_