//=============================================================================
//
// インプットクラス [input.h]
// Author : 小笠原　彪我
//
//=============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"

//*****************************************************************************
//	インプットクラス
//*****************************************************************************
class CInput
{
public:
	CInput();										// コンストラクタ
	virtual ~CInput();								// デストラクタ

	virtual HRESULT Init(HINSTANCE hInstance, HWND hWnd);	// 初期化処理
	virtual void Uninit(void);								// 終了処理
	virtual void Update(void) = 0;							// 更新処理

protected:
	LPDIRECTINPUTDEVICE8 m_pDevice;							// 入力デバイスへのポインタ
	static LPDIRECTINPUT8 m_pInput;							// DirectInputオブジェクトのポインタ
};
#endif //!_INPUT_H_