//=============================================================================
//
// リザルト（ランキングのほう）の処理 [ranking.h]
// Author : 川村優斗
//
//=============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include"scene.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;
class CRanking;
class CRankingData;

//*****************************************************************************
// リザルトのクラス
//*****************************************************************************
class CRanking : public CScene
{
public:
	CRanking();			// コンストラクタ
	~CRanking();			// デストラクタ
	
	HRESULT Init(void);	// 初期化処理
	void Uninit(void);	// 終了処理
	void Update(void);	// 更新処理
	void Draw(void);	// 描画処理

	static CRanking *Create(void);	// 生成処理
	static CRankingData *GetRanking(void);	// ランキング取得

private:
	bool				m_fade;		// フェードイン判定
	static CRankingData		*m_pRanking;// ランキングのインスタンス

};

#endif // !_RANKING_H_
