//=============================================================================
//
// リザルト（ランキング）の処理 [result.cpp]
// Author : 川村優斗
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "ranking2.h"
#include"keyboard.h"
#include"manager.h"
#include"score.h"
#include"fade.h"
#include"time.h"
#include"bg.h"
#include"sound.h"
#include"rankingdata.h"

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
CRankingData *CRanking2::m_pRanking = NULL;

//=============================================================================
// コンストラクタ
//=============================================================================
CRanking2::CRanking2()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CRanking2::~CRanking2()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CRanking2::Init(void)
{
	// 背景の生成
	CBg::Create(D3DXVECTOR3(SCREEN_CENTER_X, SCREEN_CENTER_Y, 0.0f), D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f), 38);

	//サウンド取得
	CSound *pSound = CManager::GetSound();
	pSound->Play(pSound->SOUND_LABEL_RESULT);
	pSound->SetVolume(pSound->SOUND_LABEL_RESULT, 0.8f);

	// ランキングの生成
	CRankingData::Create(D3DXVECTOR3(SCREEN_CENTER_X + 50.0f, 180.0f, 0.0f), D3DXVECTOR3(45.0f, 47.0f, 0.0f), false);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CRanking2::Uninit(void)
{
	//サウンド取得
	CSound *pSound = CManager::GetSound();
	pSound->Stop(pSound->SOUND_LABEL_RESULT);
	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CRanking2::Update(void)
{
	// フェードの取得
	CFade *pFade = CManager::GetFade();

	// キーボードの取得
	CInputKeyboard *pInputKeyboard = CManager::GetInputKeyboard();

	// タイトル行き
	if (pInputKeyboard->GetTrigger(DIK_SPACE) == true || pInputKeyboard->GetTrigger(DIK_RETURN) == true)
	{
		if (m_fade == false)
		{
			pFade->SetFade(CManager::MODE_TITLE);
			m_fade = true;
		}
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CRanking2::Draw(void)
{
}

//=============================================================================
// リザルトの生成
//=============================================================================
CRanking2 * CRanking2::Create(void)
{
	//リザルトのインスタンス生成
	CRanking2 *pRanking = new CRanking2;

	//リザルトの準備
	if (pRanking != NULL)
	{
		pRanking->Init();
	}
	return pRanking;
}

//=============================================================================
// ランキング取得
//=============================================================================
CRankingData * CRanking2::GetRanking(void)
{
	return m_pRanking;
}

