//=============================================================================
//
// スコアのクラス [score.h]
// Author : 川村優斗
//
//=============================================================================
//プリプロセッサ
#ifndef _SCORE_H_
#define _SCORE_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include"scene.h"

//*****************************************************************************
//マクロ定義
//*****************************************************************************
#define MAX_SCORE (5)

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CNumber;

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CScore : public CScene
{
public:
	CScore(int nPriority = PRIORITY_UI);	// コンストラクタ
	~CScore();					// デストラクタ

	HRESULT Init(void);// 初期化処理
	void Uninit(void); // 終了処理
	void Update(void); // 更新処理
	void Draw(void);   // 描画処理

	void SetScore(int nScore);	// スコア設定
	void AddScore(int nValue);	// スコア加算
	int GetScore(void);			// スコア取得

	static CScore *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);// 生成処理

private:
	CNumber		*m_apNumber[MAX_SCORE];	// 数字のインスタンス
	int			m_nScore;				// スコア
	D3DXVECTOR3 m_size;					// 大きさ
	D3DXVECTOR3 m_pos;					// 位置

};

#endif // !_SCORE_H_
