//=============================================================================
//
// テクスチャクラス [texture.h]
// Author : 小笠原　彪我
//
//=============================================================================
//=============================================================================
//インクルードファイル
//=============================================================================
#include "texture.h"
#include "keyboard.h"
#include "game.h"
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CTexture::m_pTexture[MAX_TEXTURE] = {};	// テクスチャへのポインタ
int CTexture::m_nType = 0;

//=============================================================================
// コンストラクタ
//=============================================================================
CTexture::CTexture()
{
	// メンバ変数のクリア
	m_nType = 0;
	m_nNumTexture = 0;
	m_nTextType = 0;
}
//=============================================================================
// デストラクタ
//=============================================================================
CTexture::~CTexture()
{
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTexture::Init(void)
{
	// デバイスを取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	char aFile[256];

	FILE *pFile = fopen(FILENAME_TEX, "r");

	if (pFile != NULL)
	{
		while (true)
		{
			fscanf(pFile, "%s", &aFile[0]);
			if (strcmp(&aFile[0], "NUM_TEXTURE") == 0)
			{
				// テクスチャ数
				fscanf(pFile, "%s", &aFile[0]);
				fscanf(pFile, "%d", &m_nNumTexture);
			}
			if (strcmp(&aFile[0], "TEXTURE_FILENAME") == 0)
			{
				// テクスチャのパス
				fscanf(pFile, "%s", &aFile[0]);
				fscanf(pFile, "%s", &aFile[0]);

				//テクスチャの読み込み
				D3DXCreateTextureFromFile(pDevice, &aFile[0], &m_pTexture[m_nType]);
				m_nType++;
			}
			if (strcmp(&aFile[0], "END_SCRIPT") == 0)
			{
				// 終了
				break;
			}
		}
		fclose(pFile);
	}


	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTexture::Uninit(void)
{
	for (int nCntTex = 0; nCntTex < m_nType; nCntTex++)
	{
		if (m_pTexture[nCntTex] != NULL)
		{
			m_pTexture[nCntTex]->Release();
			m_pTexture[nCntTex] = NULL;
		}
	}
}

//=============================================================================
// 更新処理
//=============================================================================
void CTexture::Update(void)
{

}

//=============================================================================
// 描画処理
//=============================================================================
void CTexture::Draw(void)
{

}
//=============================================================================
// プレイヤーの生成
//=============================================================================
CTexture *CTexture::Create(void)
{
	CTexture *pTexture;
	pTexture = new CTexture;

	if (pTexture != NULL)
	{
		pTexture->Init();
	}

	return pTexture;
}
//=============================================================================
// テクスチャの設定
//=============================================================================
LPDIRECT3DTEXTURE9 CTexture::SetTextureType(int nType)
{
	return m_pTexture[nType];
}
